Ran Plan for dir: `stage` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.ec2_instance.data.aws_ssm_parameter.this[0]: Read complete after 0s [id=/aws/service/ami-amazon-linux-latest/al2023-ami-kernel-default-x86_64]
module.ec2_instance.data.aws_subnet.this[0]: Read complete after 0s [id=subnet-0412aaae2878b5587]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ec2_instance.aws_instance.this[0] will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-0b982602dbb32c5bd"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "ap-south-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0412aaae2878b5587"
      + tags                                 = {
          + "Name" = "actions-runner-stage"
          + "env"  = "stage"
          + "team" = "devops"
        }
      + tags_all                             = {
          + "Name" = "actions-runner-stage"
          + "env"  = "stage"
          + "team" = "devops"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "actions-runner-stage"
          + "env"  = "stage"
          + "team" = "devops"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + credit_specification {}

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + primary_network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)

      + timeouts {}
    }

  # module.ec2_instance.aws_security_group.this[0] will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "actions-runner-stage-"
      + owner_id               = (known after apply)
      + region                 = "ap-south-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "actions-runner-stage"
          + "env"  = "stage"
          + "team" = "devops"
        }
      + tags_all               = {
          + "Name" = "actions-runner-stage"
          + "env"  = "stage"
          + "team" = "devops"
        }
      + vpc_id                 = "vpc-0f63840cd962173c5"
    }

  # module.ec2_instance.aws_vpc_security_group_egress_rule.this["ipv4_default"] will be created
+ resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all IPv4 traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "ap-south-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "actions-runner-stage-ipv4_default"
          + "env"  = "stage"
          + "team" = "devops"
        }
      + tags_all               = {
          + "Name" = "actions-runner-stage-ipv4_default"
          + "env"  = "stage"
          + "team" = "devops"
        }
    }

  # module.ec2_instance.aws_vpc_security_group_egress_rule.this["ipv6_default"] will be created
+ resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "::/0"
      + description            = "Allow all IPv6 traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "ap-south-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "actions-runner-stage-ipv6_default"
          + "env"  = "stage"
          + "team" = "devops"
        }
      + tags_all               = {
          + "Name" = "actions-runner-stage-ipv6_default"
          + "env"  = "stage"
          + "team" = "devops"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.tf_state_bucket_s3_2025,
│   on main.tf line 21, in resource "aws_s3_bucket" "tf_state_bucket_s3_2025":
│   21: resource "aws_s3_bucket" "tf_state_bucket_s3_2025" {
│ 
│ versioning is deprecated. Use the aws_s3_bucket_versioning resource
│ instead.
│ 
│ (and one more similar warning elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=poptech-global-tech-pvt-ltd%252Fterraforming-pop-stage%252Fstage%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d stage
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```